In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
pd.isnull(np.nan)

True

In [4]:
pd.isnull(None)

True

In [5]:
pd.isna(None)

True

In [6]:
pd.notnull(None)

False

In [7]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

In [9]:
pd.Series([1, 2, np.nan]).count()

2

In [12]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [13]:
pd.Series([2, 2, np.nan]).mean()

2.0

In [14]:
pd.Series([2, 2, np.nan]).mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0    2.0
1    2.0
2    NaN
dtype: float64>

In [19]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 32, 110]
})

In [20]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        32
3       NaN       NaN     100.0       110

In [21]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [22]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [23]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        32

In [24]:
df.dropna(axis=1) # axis='columns' also works

   Column D
0         5
1         8
2        32
3       110

In [30]:
df2 = pd.DataFrame({
    'Column A': [1, np.nan, 30,],
    'Column B': [2, np.nan, 31,],
    'Column C': [np.nan, np.nan, 100],
})

In [31]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [33]:
df

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [34]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 32, 110]
})

In [35]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        32
3       NaN       NaN     100.0       110

In [36]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [37]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        32
3       NaN       NaN     100.0       110

In [38]:
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        32
3       NaN       NaN     100.0       110

In [39]:
df.dropna(how='any')

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        32

In [40]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        32
3       NaN       NaN     100.0       110

In [41]:
df.dropna(thresh=3)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        32

In [42]:
df.dropna(thresh=3, axis='columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        32
3       NaN     100.0       110